title: Top 8 free readings
date: 2014-09-10 23:29:54
tags:
 - learning
 - reading
---

这是一个“信息大爆炸”的时代，在没有互联网的时候说这句话可能有人会怀疑，但是有了互联网之后大家都深信不疑。根据加州大学圣地亚哥分校的研究，一个典型的美国家庭在2008年平均收到3.6 ZB的信息，每人每天平均收到34 GB的信息，这只是2008年的研究结果，有人预测，每5年全世界的信息总量就会增加10倍。网络新闻、社交网络、邮箱、电视以及各种媒体每天都充斥你的左右，你是否也有信息焦虑症和选择困难症呢？

<!-- more -->

作为程序员，我们是天生的“学习者”，面对日新月异的新思想、新技术，我们主动或被动地获取相关的信息和知识以充实我们的大脑，完善自己的知识架构。信息技术领域变化飞快，这就要求我们能够高效地学习，如果只是盲目地在网络上左看右看，虽然能够找到有趣的内容，但难免会浪费很多时间，得不偿失。为了应对这个问题，下面列出8个适合程序员学习的聚合资源或垂直社区，可以帮助有效定位相关知识，大家各取所需吧（排名不分先后）。

### 学习资源

#### 码农周刊

由[developerWorks](http://weibo.com/developerworks)（微博帐号，应该不是IBM开发网络的官方帐号，只是名字碰巧相同）运营的码农周刊，可以通过邮件订阅，有时也发日报，个人觉得日报有点儿过头了，周刊都不一定能及时看完，推荐周刊。技术文章有分类，也有一些不影响阅读的广告和职位招聘信息。地址：http://weekly.manong.io/

#### Get新知社区

由[Easy](http://weibo.com/easy)（微博帐号）主导运营、新近才开张的一个学习型社区。个人感觉界面比较清新舒适，加上Easy本人技术能力过硬，推荐的资源（有些是他自己写的）一般比较靠谱。地址：http://get.jobdeer.com/

#### Startup News

由[Fenng](http://weibo.com/fenng)（丁香园CTO、小道消息出品人）运营的Startup News在程序员圈里也算小有名气，算是[Hackernews](https://news.ycombinator.com/)的中国版吧，质量方面前一阵Fenng曾经整顿过，因为属于聚合资源，所以自己要有点鉴别能力。地址：http://news.dbanotes.net/

#### 好东西传送门

由[西瓜大丸子汤](http://weibo.com/xiguadawanzitang)（微博帐号）主导运营、也是新开张的在线收藏列表。界面上设计感不强，但也算流畅，博主本人也是技术牛人，所以质量方面还是可以保证的。地址：http://hao.memect.com/

#### 极客头条

由CSDN运营的极客头条，我自己看的不多，但毕竟是中国最大的程序员开发网络出品，呵呵，所以，还是要关注一下。地址：http://geek.csdn.net/

####《架构师》期刊

Infoq官方出品，有深度、有广度、干货多，不容易消化，一般都不是入门级教程，95后年轻程序员慎入。地址：http://www.infoq.com/cn/architect/

####《码农》期刊

相比《架构师》，《码农》这个名字有点自嘲的意思，有的猿媛不喜欢这个称呼，认为有点自轻自贱，其实认真你就输了。推荐你听一下Beyond的[《农民》](http://music.163.com/#/song?id=347502)，也许你感觉就不一样了。地址：http://www.ituring.com.cn/book/tagged/1735

####《编程狂人》期刊

推酷推出的期刊，我没有仔细看过，等我看完之后补一点感受，第一印象还可以。地址：http://www.tuicool.com/mags

### Bonus

#### Ourcoders

由tiny叔（大家都这么叫）运营的“我们是猿媛”是程序员的交流社区，无聊或苦闷的时候上去聊聊吧：http://ourcoders.com/home/

#### v2ex

Way to explore，也是一个交流社区，挺好玩的，学习枯燥的时候上去扯一扯愉悦身心：http://v2ex.com

### 后记

这篇文章主要是收集一些中文的轻量级学习资源，虽说是轻量级，如果学习没有方向和重点也是“乱花渐欲迷人眼”，所以还是要找准方向，专注而后精进，才能学有小成。祝大家学习愉快！

### 参考资源
 - http://blog.sciencenet.cn/blog-50350-301466.html
